[{"title":"Release v0.6.0","id":8,"date":"February 24, 2025","content":"<h2>New Features</h2>\n<p>With this release, we’re introducing an exciting new feature in your profile! A new <strong>Stats</strong> tab is now available, tracking your weekly workout duration and session count. </p>\n<p>It also compares your progress against the <strong>WHO’s recommended 150 minutes of weekly activity</strong> for a healthier life. Stay motivated and keep moving! </p>\n<p>A new activity type, <strong>Alpine Ski Touring</strong>, is now available in the workout tracker - ensuring all ski tourers are covered! ⛷️❄️ Track your adventures and push your limits!</p>\n","slug":"v.0.6.0"},{"title":"Release v0.5.2","id":7,"date":"February 14, 2025","content":"<h2>Bug fixes</h2>\n<p>This version fixes a frontend bug that in certain cases caused the application to send a workout when selecting an exercise.</p>\n","slug":"v.0.5.2"},{"title":"Release v0.5.1","id":6,"date":"February 7, 2025","content":"<h2>New Features</h2>\n<ul>\n<li><p><strong>Learn to Use the App:</strong> A new <em>getting-started</em> page has been added to the homepage. This is especially helpful for users unfamiliar with the concept of Internet Identity. It provides essential information about this authentication method and, most importantly, guides you on how to set up your own Internet Identity.</p>\n</li>\n<li><p><strong>3 new exercises have been added to the App:</strong> Bird Dog, Side Plank and Core Stabilizer. These exercises are now available for you to track your progress.</p>\n</li>\n</ul>\n<h2>Bird Dog</h2>\n<p>This essential core stability move enhances balance, coordination and deep core strength—perfect for improving posture and preventing lower back pain.</p>\n<p>Starting in a quadruped position (on hands and knees), you extend one arm and the opposite leg while maintaining a neutral spine. The slow, controlled movement activates your core, glutes, and back muscles for improved full-body stability.</p>\n<h2>Side Plank</h2>\n<p>The Side Plank is a powerful core exercise that targets the obliques, deep core, and shoulders, improving balance, stability, and posture. It’s also great for building core endurance and preventing lower back injuries.</p>\n<p>How to Perform a Side Plank:</p>\n<ul>\n<li>Start: Lie on your side, legs straight, feet stacked, elbow under shoulder.</li>\n<li>Lift: Raise your hips, forming a straight line from head to heels.</li>\n<li>Hold: Maintain for 15-60 seconds, keeping core and glutes engaged.</li>\n<li>Switch: Repeat on the other side.</li>\n</ul>\n<p>Stay stable and avoid sagging hips for best results!</p>\n<h2>Core Stabilizer</h2>\n<p>The Core Stabilizer is a dynamic workout routine designed to strengthen and challenge your deep core muscles. It improves balance, stability and posture while boosting core endurance and reducing the risk of lower back injuries. This feature brings together multiple core-focused exercises, including the Bird Dog, Side Plank and more, giving you the tools to track and progress through a variety of core-strengthening movements.</p>\n","slug":"v.0.5.1"},{"title":"Release v0.5.0","id":5,"date":"February 6, 2025","content":"<h2>New Features</h2>\n<ul>\n<li><strong>Delete Your Workouts:</strong> You can now delete workouts you’ve added. This feature is useful if you made a mistake or no longer want a workout in your records. However, be cautious - once deleted, a workout cannot be recovered, and your points will be recalculated. The workout will remain in the latest workouts feed until a certain number of new workouts have been added, after which it will be automatically removed.</li>\n</ul>\n","slug":"v.0.5.0"},{"title":"Release v0.4.0","id":4,"date":"January 30, 2025","content":"<h2>New Features</h2>\n<ul>\n<li><strong>Enhanced the UI/UX</strong> with a sticky header that remains visible as you scroll. This feature improves navigation, allowing easy access to the main menu at any time</li>\n<li><strong>Ranking:</strong> Only users with points greater than zero are displayed. This feature keeps the ranking list clean and relevant.”</li>\n<li><strong>New Point Rules:</strong> Users now earn points for adding friends and completing each exercise repetition. This feature encourages community engagement and promotes consistent activity on the platform.</li>\n<li><strong>Manual Workout Duration:</strong> Users can now manually enter their workout duration before submitting, allowing for more accurate time tracking.</li>\n</ul>\n<h3>Points System Summary</h3>\n<ul>\n<li>Add a workout: +10 points</li>\n<li>Add an exercise: +1 point</li>\n<li>Each exercise repetition: +1 point</li>\n<li>Add a friend: +10 points</li>\n<li>Remove a friend: -10 points</li>\n</ul>\n","slug":"v.0.4.0"},{"title":"Release v0.3.2","id":3,"date":"January 29, 2025","content":"<h2>Bug Fixes</h2>\n<ul>\n<li><strong>Latest Workouts:</strong> Fixed a bug that prevented the latest public workouts from updating correctly. This issue also triggered the <strong>first data migration from version 0.1.0 to 0.1.1.</strong> The migration was successful 🥳, ensuring that all data was properly updated. The latest workouts list now updates correctly.</li>\n</ul>\n","slug":"v.0.3.2"},{"title":"Release v0.3.1","id":2,"date":"January 29, 2025","content":"<h2>New Features</h2>\n<ul>\n<li><p><strong>New Activity</strong>: Introducing a new activity: Daily Morning Routine. This feature allows you to track your morning routine, whatever it may include, helping you stay consistent and organized.</p>\n</li>\n<li><p><strong>Added a new Activity</strong>: Enlarged timer for improved visibility.</p>\n</li>\n</ul>\n","slug":"v.0.3.1"},{"title":"Release v0.3.0","id":1,"date":"January 28, 2025","content":"<h2>New Features</h2>\n<ul>\n<li><strong>Stopwatch Component</strong>: Added a new stopwatch component to measure the duration of workouts.</li>\n<li><strong>PWA Updater</strong>: Display a notification when a new version of the PWA is available.</li>\n<li><strong>Improved Navigation</strong>: Enhanced navigation with better handling of sidebar and links.</li>\n</ul>\n<p>We hope you enjoy the new features and improvements in this release. If you encounter any issues or have feedback, please reach out to our support team.</p>\n","slug":"v0.3.0"},{"title":"What is BeProActive?","date":"January 27, 2025","content":"<h2>BeProActive</h2>\n<p>A fully featured application emerged from a simple holiday project.</p>\n<p><img src=\"/beProActive.webp\" alt=\"BeProActive\"></p>\n<p><strong>BeProActive</strong> is an attempt to develop a fitness and health tracking application on the Internet Computer with the goal of complete anonymity of its users.</p>\n<p>An Internet Identity is the only thing you need. All your data is securely anonymous and bound to that specific Internet Identity.</p>\n<p>Monitor your fitness activities and stay connected with friends through activity feeds. We currently offer 42 fitness activities and can expand our offerings upon request.</p>\n<p>A leaderboard with a simple gamification aspect is included. Points are currently awarded as follows: 10 points per workout and 1 point per each exercise. Additional points can be incorporated as needed.</p>\n<p>We hope you enjoy using the dApp and that it becomes a valuable tool to support your fitness and health goals.</p>\n","slug":"index"}]