[{"title":"Release v0.4.0","id":4,"date":"January 30, 2025","content":"<h2>New Features</h2>\n<ul>\n<li><strong>Enhanced the UI/UX</strong> with a sticky header that remains visible as you scroll. This feature improves navigation, allowing easy access to the main menu at any time</li>\n<li><strong>Ranking:</strong> Only users with points greater than zero are displayed. This feature keeps the ranking list clean and relevant.”</li>\n<li><strong>New Point Rules:</strong> Users now earn points for adding friends and completing each exercise repetition. This feature encourages community engagement and promotes consistent activity on the platform.</li>\n<li><strong>Manual Workout Duration:</strong> Users can now manually enter their workout duration before submitting, allowing for more accurate time tracking.</li>\n</ul>\n<h3>Points System Summary</h3>\n<ul>\n<li>Add a workout: +10 points</li>\n<li>Add an exercise: +1 point</li>\n<li>Each exercise repetition: +1 point</li>\n<li>Add a friend: +10 points</li>\n<li>Remove a friend: -10 points</li>\n</ul>\n","slug":"v.0.4.0"},{"title":"Release v0.3.2","id":3,"date":"January 29, 2025","content":"<h2>Bug Fixes</h2>\n<ul>\n<li><strong>Latest Workouts:</strong> Fixed a bug that prevented the latest public workouts from updating correctly. This issue also triggered the <strong>first data migration from version 0.1.0 to 0.1.1.</strong> The migration was successful 🥳, ensuring that all data was properly updated. The latest workouts list now updates correctly.</li>\n</ul>\n","slug":"v.0.3.2"},{"title":"Release v0.3.1","id":2,"date":"January 29, 2025","content":"<h2>New Features</h2>\n<ul>\n<li><p><strong>New Activity</strong>: Introducing a new activity: Daily Morning Routine. This feature allows you to track your morning routine, whatever it may include, helping you stay consistent and organized.</p>\n</li>\n<li><p><strong>Added a new Activity</strong>: Enlarged timer for improved visibility.</p>\n</li>\n</ul>\n","slug":"v.0.3.1"},{"title":"Release v0.3.0","id":1,"date":"January 28, 2025","content":"<h2>New Features</h2>\n<ul>\n<li><strong>Stopwatch Component</strong>: Added a new stopwatch component to measure the duration of workouts.</li>\n<li><strong>PWA Updater</strong>: Display a notification when a new version of the PWA is available.</li>\n<li><strong>Improved Navigation</strong>: Enhanced navigation with better handling of sidebar and links.</li>\n</ul>\n<p>We hope you enjoy the new features and improvements in this release. If you encounter any issues or have feedback, please reach out to our support team.</p>\n","slug":"v0.3.0"},{"title":"What is BeProActive?","date":"January 27, 2025","content":"<h2>BeProActive</h2>\n<p>A fully featured application emerged from a simple holiday project.</p>\n<p><img src=\"/beProActive.webp\" alt=\"BeProActive\"></p>\n<p><strong>BeProActive</strong> is an attempt to develop a fitness and health tracking application on the Internet Computer with the goal of complete anonymity of its users.</p>\n<p>An Internet Identity is the only thing you need. All your data is securely anonymous and bound to that specific Internet Identity.</p>\n<p>Monitor your fitness activities and stay connected with friends through activity feeds. We currently offer 42 fitness activities and can expand our offerings upon request.</p>\n<p>A leaderboard with a simple gamification aspect is included. Points are currently awarded as follows: 10 points per workout and 1 point per each exercise. Additional points can be incorporated as needed.</p>\n<p>We hope you enjoy using the dApp and that it becomes a valuable tool to support your fitness and health goals.</p>\n","slug":"index"}]